[
  {
    "q": "What is Shared Values Visa?",
    "a": "The Russia Shared Values Visa (Decree No. 702) is a government pathway to temporary residence for foreigners who align with traditional cultural and family values, giving a direct route to a Temporary Residence Permit and later permanent residency. It is positioned as a relocation route to the Russian Federation (Russia) (federation)."
  },
  {
    "q": "Can Americans get a visa to Russia now?",
    "a": "Yes. Americans can apply for the Russia Shared Values Visa if they meet eligibility rules, prepare the required documents, and complete the in-country submission after receiving the official invitation. Final steps are handled through a Russian consulate and Russian migration procedures."
  },
  {
    "q": "How many people applied for a Shared Values Visa?",
    "a": "Russian authorities report thousands of Shared Values Visa applications since 2024; slots remain open, and processing continues while quotas are available. Availability can depend on regional quota limits in Russia."
  },
  {
    "q": "How to apply for a Russia Shared Values Visa?",
    "a": "Check eligibility, gather police and medical certificates, translate and apostille documents, obtain an invitation, then file the Russian Temporary Residence Permit application in Russia under Decree No. 702. Make sure the name on all documents matches the passport name."
  },
  {
    "q": "What countries are covered by Russia Shared Values Visa?",
    "a": "Citizens of 47 eligible countries can apply, including the USA, Canada, EU and UK states, Australia, New Zealand, Israel, and several Gulf and Latin American nations; always verify the latest list before applying. The list is set by the Russian Federation."
  },
  {
    "q": "Do I need to speak Russian?",
    "a": "Not for the Shared Values Visa application itself. You can learn it after you arrive. There is no language exam required for the initial visa, and there is no mandatory Russian language test at the first step."
  },
  {
    "q": "Can I work in Russia?",
    "a": "Yes. Once you receive a Russian Temporary Residence Permit (TRP), you have the full right to work in Russia without needing a separate work permit. Some applicants also explore Russian business options after arrival."
  },
  {
    "q": "How long does the process take?",
    "a": "Plan for 12-18 months end-to-end, including document prep, travel, and the Russian TRP processing window inside Russia. Timelines can vary by Russian region in Russia."
  },
  {
    "q": "Is my family eligible?",
    "a": "Yes, a spouse and minor children can be included in the process to move with you. This helps with family and social stability during the transition to Russia."
  },
  {
    "q": "Do I have to renounce my current citizenship?",
    "a": "No, Russia allows dual citizenship in many cases, and you do not need to give up the passport to get a TRP. Always confirm the latest rules under Russian law."
  }
]
